GroupBy
Aggregation

## GroupBy

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Store': ['S1', 'S1', 'S2', 'S2', 'S1', 'S2', 'S2', 'S1'],
    'Sales': [100, 200, 150, 250, 120, 180, 200, 300],
    'Quantity': [10, 15, 12, 18, 8, 20, 15, 25],
    'Date': pd.date_range('2023-01-01', periods=8)
}
df =pd.DataFrame(data)

In [3]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [10]:
# group by Category and calculate the sum of cells
df2= df.groupby("Category")["Sales"].sum()
df2

Category
A    570
B    930
Name: Sales, dtype: int64

In [13]:
# Group by store and calculate the sum of sales
df2= df.groupby("Store")["Sales"].sum()
df2

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [16]:
# Group by multiple coloums 
# Group by Category and Store
df2= df.groupby(["Category","Store"])["Sales"].sum()  # add the multiple add in ([]) paranthesis
df2

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

## Aggregation

In [18]:
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

In [ ]:
df["Sales"].mean()

# """mean median min max count std"""

np.float64(187.5)

In [ ]:
# the used in function
df["Sales"].agg(["sum","mean","min","count","std","median"]) # the multiple count one time (agg) in output

sum       1500.000000
mean       187.500000
min        100.000000
count        8.000000
std         66.062741
median     190.000000
Name: Sales, dtype: float64